# Подготовка рекомендательной системы для покупки курсов в онлайн-школе MasterMind

**ЦЕЛЬ**<br>
Подготовить основу рекомендательной системы, благодаря которой можно будет предлагать клиентам интересные им курсы и тем самым повышать средний чек.

**ЗАДАЧИ**<br>
Оформление таблицы, в которой каждому курсу будет соответствовать по два рекомендованных к покупке курса.

**КОНКРЕТНЫЕ ШАГИ (ФОРМАЛИЗОВАННЫЕ ЗАДАЧИ)**<br>
- Проанализировать базу данных о продажах за 2017-2018 гг. с помощью SQL
- Выгрузить из БД необходимые данные
- Обработать данные в Python
- Получить рекомендательную таблицу

**Использованные библиотеки и модули**
pandas
numpy
itertools
collections
psycopg2
